Repository: skoona/4DExplorer
Catalog: Components_Archive/4D ViewPro.4dbase/Resources/*.lproj/4DViewPro.xlf
Languages: cs, es, fr, ja, pt

# ERR_4DVP_0
source: 4D View Pro commands are only available with a 64-bit version of 4D.
cs: 4D View Pro příkazy jsou dostupné pouze pro 64-bit verzi 4D.
es: Los comandos 4D View Pro solo están disponibles con la versión de 64 bits de 4D.
fr: Les commandes 4D View Pro ne sont disponibles qu'avec une version 64 bits de 4D.
ja: 4D View Proコマンドは64-bit版の4Dでのみお使いいただけます。
pt: Os comandos 4D View Pro só estão disponíveis com a versão de 64-bit do 4D.

# ERR_4DVP_1
source: Invalid 4D View Pro object.
cs: Neplatný 4D View Pro objekt.
es: Objeto 4D View Pro no válido
fr: Objet 4D View Pro non valide.
ja: 無効な4D View Proオブジェクトです。
pt: Objeto 4D View Pro inválido.

# ERR_4DVP_2
source: Internal error [{message}].
cs: Interní chyba [{message}].
es: Error interno [{message}].
fr: Erreur interne [{message}].
ja: 内部エラー[{message}]
pt: Erro interno [{message}].

# ERR_4DVP_4
source: The file "{name}" is not a valid 4D View Pro file.
cs: Soubor "{name}" není platný 4D View Pro soubor.
es: El archivo "{name}" no es un archivo válido de 4D View Pro.
fr: Le fichier "{name}" n'est pas un fichier 4D View Pro valide.
ja: "{name}"のファイルは有効な4D View Proファイルではありません。
pt: O arquivo "{name}" não é um arquivo válido de 4D View Pro.

# ERR_4DVP_8
source: Cannot create file "{name}".
cs: Nelze vytvořit soubor "{name}".
es: No se puede crear el archivo "{name}".
fr: Impossible de créer le fichier "{name}".
ja: ファイル"{name}"を作成できません。
pt: Não é possível criar o arquivo "{name}".

# ERR_4DVP_5
source: The area "{object}" is not yet available. The command "{command}" cannot be applied.
cs: Oblast "{object}" není ještě dostupná. Příkaz "{command}" nelze použít.
es: El área "{object}" aún no está disponible. No se puede aplicar el comando "{command}".
fr: La zone "{object}" n'est pas encore disponible. La commande "{command}" ne peut pas être appliquée
ja: "{object}"エリアはまだ利用できません。 "{command}"コマンドは適用できません。
pt: A área "{object}" ainda não está disponível. O comando "{command}" não pode ser aplicado.

# ERR_4DVP_7
source: Cannot import file "{name}".
cs: Nelze importovat soubor "{name}".
es: No se puede importar el archivo "{name}".
fr: Impossible d'importer le fichier "{name}".
ja: "{name}"を読み込めませんでした。
pt: Não é possível importar o arquivo "{name}".

# ERR_4DVP_9
source: Property "area" is missing.
cs: Vlastnost "oblast" chybí.
es: Falta la propiedad "area".
fr: La propriété "area" est manquante.
ja: "area" プロパティが見つかりません。
pt: Propriedade "area" está ausente.

# ERR_4DVP_10
source: Ranges should have same "area" property.
cs: Rozsahy by měli mít stejnou vlastnost "oblast".
es: Los rangos deben tener una propiedad "area".
fr: Les plages doivent avoir une propriété "area".
ja: レンジは同じ"area"プロパティを持っている必要があります。
pt: Os intervalos devem ter uma propriedade "area".

# ERR_4DVP_11
source: Ranges are missing.
cs: Chybí rozsahy.
es: Faltan los rangos
fr: La plage est manquante.
ja: レンジがありません。
pt: Os intervalos estão faltando.

# ERR_4DVP_12
source: No object found in "ranges" collection.
cs: Nenalezen žádný objekt v kolekci "rozsahů".
es: No se encontró ningún objeto en la colección "ranges".
fr: Objet manquant dans la collection "ranges".
ja: "ranges" コレクション内にオブジェクトが見つかりません。
pt: Nenhum objeto encontrado na coleção "ranges".

# ERR_4DVP_13
source: Column must be greater or equal than zero.
cs: Sloupec musí být větší nebo roven nule.
es: La columna debe ser mayor o igual que cero.
fr: La propriété "column" doit être supérieure ou égale à zéro.
ja: カラムは0以上である必要があります。
pt: A coluna deve ser maior ou igual a zero.

# ERR_4DVP_14
source: Row must be greater or equal than zero.
cs: Řada musí být větší nebo rovna nule.
es: La fila debe ser mayor o igual que cero.
fr: La propriété "row" doit être supérieure ou égale à zéro.
ja: 行は0以上である必要があります。
pt: A linha deve ser maior ou igual a zero.

# ERR_4DVP_15
source: Column count must be greater than zero.
cs: CPočet sloupců musí být větší než nula.
es: El recuento de columnas debe ser mayor que cero.
fr: La propriété "columnCount" doit être supérieure à zéro.
ja: カラムの数は0より大きい必要があります。
pt: Contagem de coluna deve ser maior que zero.

# ERR_4DVP_16
source: Row count must be greater than zero.
cs: Počet řad musí být větší než nula.
es: El recuento de filas debe ser mayor que cero.
fr: La propriété "rowCount" doit être supérieure à zéro.
ja: 行の数は0より大きい必要があります。
pt: Contagem de linhas deve ser maior que zero.

# ERR_4DVP_17
source: Sheet must be greater or equal than -2.
cs: List musí být větší nebo roven -2.
es: La hoja debe ser mayor o igual a-2.
fr: La propriété "sheet" doit être supérieure ou égale à -2.
ja: シートは-2 以上である必要があります。
pt: A folha deve ser maior ou igual a-2.

# ERR_4DVP_18
source: Name should not be an empty string.
cs: Název nesmí být prázdný řetězec.
es: El nombre no debe ser una cadena vacía.
fr: La propriété "name" ne doit pas être vide.
ja: 名前に空の文字列は使用できません。
pt: O nome não deve ser uma cadeia de caracteres vazia.

# ERR_4DVP_19
source: Sheet index should not be greater than or equal to the number of sheets.
cs: Číslo listu by nemělo být větší nebo rovno než počet listů.
es: El índice de la hoja no debe ser mayor o igual que el número de hojas.
fr: L'index de la feuille de calcul ne peut pas être supérieur ou égal au nombre de feuilles.
ja: シートのインデックスは実際のシート数未満の数でなければなりません。
pt: O índice da folha não deve ser maior ou igual ao número de folhas.

# ERR_4DVP_20
source: 4D View document is corrupted and cannot be converted.
cs: 4D View document je poškozen a nemůže být konvertován.
es: El documento de 4D View está dañado y no se puede convertir.
fr: Le document 4D View est corrompu et ne peut pas être converti.
ja: 4D View ドキュメントは壊れており、変換できません。
pt: O documento 4D View está corrompido e não pode ser convertido.

# ERR_4DVP_21
source: Sheet index should be a numeric value.
cs: Index listu by měl být číselná hodnota.
es: El índice de la hoja debe ser numérico.
fr: L'index de la feuille doit être un numérique.
ja: シートインデックスには数値を指定して下さい。
pt: O índice da folha deve ser um valor numérico.

# ERR_4DVP_22
source: Range is mandatory to export a csv file.
cs: Pro export csv souboru je povinný rozsah.
es: Se requiere un rango para exportar a un archivo csv.
fr: Une plage est nécessaire pour exporter en fichier csv.
ja: CSVファイルを書き出すためにはレンジが必要です。
pt: O intervalo é obrigatório para exportar um arquivo csv.

# Convert_sheet
source: Sheet1
cs: List1
es: Hoja1
fr: feuille1
ja: シート1
pt: Folha1
